literate-wallpaper.org
#+title: =wallpaper.el=: Setting the wallpaper
#+subtitle: A literate Emacs package for wallpaper management
#+author: Farlado
#+startup: hideblocks
#+property: header-args :tangle "wallpaper.el"
#+export_exclude_tags: noexport

* Table of contents :toc:quote:
#+BEGIN_QUOTE
- [[#about-this-package][About this Package]]
  - [[#license][License]]
  - [[#installation][Installation]]
  - [[#caveat-lector][Caveat lector]]
- [[#configuration][Configuration]]
  - [[#per-workspace-wallpapers][Per-workspace wallpapers]]
  - [[#static-wallpapers][Static wallpaper(s)]]
  - [[#cycling-wallpapers][Cycling wallpapers]]
  - [[#wallpaper-style][Wallpaper style]]
- [[#setting-the-wallpaper-once][Setting the wallpaper once]]
  - [[#arguments-for-feh-command][Arguments for ~feh~ command]]
  - [[#per-workspace-wallpapers-1][Per-workspace wallpaper(s)]]
  - [[#static-wallpapers-1][Static wallpaper(s)]]
  - [[#random-wallpapers][Random wallpaper(s)]]
- [[#cycling-wallpapers-automatically][Cycling wallpapers automatically]]
- [[#per-workspace-wallpapers-2][Per-workspace wallpapers]]
#+END_QUOTE

* About this Package

  Ricing [[https://github.com/ch11ng/exwm][EXWM]] is pretty cool, but even cooler is being able to manage everything
  about your rice using Emacs. This package is meant to make that a little bit
  easier, by managing your wallpapers for you. Compatibility is only guaranteed
  in X desktop sessions. Using this package with EXWM is the intention, but it
  can serve as a wallpaper daemon on other window managers with some work.

  This package was written using literate programming, so code is included
  alongside the documentation.

  #+begin_src emacs-lisp :noweb yes
    ;;; wallpaper.el --- Setting the wallpaper -*- lexical-binding: t -*-

    ;; Copyright (C) 2020

    ;; Author: Farlado <farlado@sdf.org>
    ;; URL: https://github.com/farlado/emacs-wallpaper
    ;; Keywords: unix, wallpaper, extensions
    ;; Package-Version: 1.1.0
    ;; Package-Requires: ((emacs "25.1"))

    ;; This file is not part of GNU Emacs.

    <<license>>

    

    ;;; Commentary:

    ;; Ricing `exwm' is pretty cool, but even cooler is being able to manage
    ;; everything about your rice using Emacs.  This package is meant to
    ;; make that a little bit easier, by managing your wallpapers for you.
    ;;
    ;; The provided modes are `wallpaper-cycle-mode' for cycling randomly
    ;; through wallpapers in a directory, and `wallpaper-per-workspace-mode'
    ;; for setting a specific wallpaper or wallpapers in each workspace or
    ;; a window manager.
    ;;
    ;; The following window managers are known to work with this package:
    ;; - EXWM
    ;; - Any that use vdesk for virtual desktops
    ;;
    ;; The following might work but aren't fully tested:
    ;; - i3
    ;;
    ;; Compatibility is only guaranteed with use of an X desktop session.

    

    ;;; Code:
  #+end_src

** License

   This package is licensed under version 3 of the GNU General Public License.

   #+name: license
   #+begin_src emacs-lisp :tangle no
     ;; This program is free software; you can redistribute it and/or modify
     ;; it under the terms of the GNU General Public License as published by
     ;; the Free Software Foundation, either version 3 of the License, or
     ;; (at your option) any later version.

     ;; This program is distributed in the hope that it will be useful,
     ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
     ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
     ;; GNU General Public License for more details.

     ;; You should have received a copy of the GNU General Public License
     ;; along with this program.  If not, see <https://www.gnu.org/licenses/>.
   #+end_src

** Installation

   Eventually I'll get this package on MELPA, just you wait and see... Till
   then, you're on your own to clone this repository and get it added to your
   =load-path=. An example configuration using ~use-package~ is included below:

   #+begin_src emacs-lisp :tangle no
     ;; This is an example `use-package' configuration
     ;; It is not tangled into wallpaper.el
     (use-package wallpaper
       :load-path "lisp/wallpaper"
       :hook ((exwm-randr-screen-change . wallpaper-set-wallpaper)
              (after-init . wallpaper-cycle-mode))
       :custom ((wallpaper-single t)
                (wallpaper-scaling 'scale)
                (wallpaper-cycle-interval 45)
                (wallpaper-directory "~/Pictures/wallpapers")))
   #+end_src

   However, no amount of hand-holding can ensure you have the dependency ~feh~
   installed, or that you are loading this package while in an X desktop
   session.

   #+begin_src emacs-lisp
     (unless (executable-find "feh")
       (display-warning 'wallpaper "Could not find feh, is it installed?"))
   #+end_src

   This package also depends on ~cl-lib~.

   #+begin_src emacs-lisp
     (require 'cl-lib)
   #+end_src

** Caveat lector

   Right now, this thing is still quite rough around the edges. As it gets
   ready for MELPA, it'll probably go through a lot of fixes. Do not hesitate
   to open an issue or request a new feature, and I will see to it that I do
   what I can.

* Configuration

  #+begin_src emacs-lisp :exports none
    
  #+end_src

  Settings for this package can be configured using ~customize~. This can be done
  by doing =M-x customize-group RET wallpaper RET=.

  #+begin_src emacs-lisp
    (defgroup wallpaper nil
      "Setting the wallpaper."
      :tag "Wallpaper"
      :group 'environment
      :prefix "wallpaper-")
  #+end_src

** Per-workspace wallpapers

   #+begin_src emacs-lisp :exports none
     
   #+end_src

*** Choosing wallpapers for workspaces

    If you wish to have a unique wallpaper or set of wallpapers for each
    workspace, assign one or multiple wallpapers as absolute paths in a string
    to a workspace using the variable =wallpaper-per-workspace-alist=. A blank
    string or nil on a workspace means deferring either to static wallpaper(s)
    or a random wallpaper if =wallpaper-static-wallpapers= is blank.

    #+begin_src emacs-lisp
      (defcustom wallpaper-per-workspace-alist nil
        "List of wallpapers per workspace.

      Each item is (WORKSPACE . WALLPAPERS).  When WORKSPACE is the current
      workspace, WALLPAPERS are the wallpapers to be set."
        :tag "Per-workspace alist"
        :group 'wallpaper
        :type '(alist :key-type (number :tag "Workspace")
                      :value-type (string :tag "Wallpaper(s)")))
    #+end_src

    An example may look as follows:

    #+begin_src emacs-lisp :tangle no
      ;; This is an example, not tangled into wallpaper.el
      (setq wallpaper-per-workspace-alist '((0 . "/path/to/0.png")
                                            (1 . "/path/to/1.png")
                                            (2 . nil)
                                            (3 . "/so/on/so/forth/2.png")
                                            ...))
    #+end_src

*** Getting the workspace number

    Per-workspace wallpaper compatibility is ONLY guaranteed with EXWM, but I've
    left enough for this to be used with other window managers with good enough
    configuration. Once I've got some experience using it with other WMs, I'll
    leave a guide in the about section.

    In the meantime, =wallpaper-per-workspace-get= points to the function used to
    get the current workspace. The function ~wallpaper-per-workspace-exwm-get~
    is provided for use with EXWM. This is the default value for this variable.
    There is also a function for i3: ~wallpaper-per-workspace-i3-get~.

    #+begin_src emacs-lisp
      (defcustom wallpaper-per-workspace-get #'wallpaper-per-workspace-exwm-get
        "What function to use for determining the current workspace."
        :tag "Per-workspace function"
        :group 'wallpaper
        :type 'function)
    #+end_src

** Static wallpaper(s)

   #+begin_src emacs-lisp :exports none
     
   #+end_src

   If you only want to use a certain wallpaper or set of wallpapers across
   monitors, set =wallpaper-static-wallpapers= to a string containing multiple
   absolute paths to the desired wallpapers, in the order of the monitors they
   should be on.

   #+begin_src emacs-lisp
     (defcustom wallpaper-static-wallpapers ""
       "List of wallpapers to use instead of randomly finding wallpapers.

     Wallpapers must be entered in this list as absolute paths, in the order
     of your monitors.  This string should be left blank if you intend to use
     function `wallpaper-cycle-mode'."
       :tag "Static wallpaper(s)"
       :group 'wallpaper
       :type 'string)
   #+end_src

   For instance, if I wanted =1.png= on my first monitor, =3.png= on my second
   monitor, and =2.png= on my third monitor, I would have to arrange them in the
   string as:

   #+begin_src emacs-lisp :tangle no
     ;; This is an example, not tangled into wallpaper.el
     (setq wallpaper-static-wallpapers "1.png 3.png 2.png")
   #+end_src

** Cycling wallpapers

   #+begin_src emacs-lisp :exports none
     
   #+end_src

*** Wallpaper cycle speed

    If you are cycling through your wallpapers automatically and want to make
    wallpaper cycling faster or slower, set =wallpaper-cycle-interval= to the
    number of seconds you want to see each wallpaper. The default is a likely
    blazing fast fifteen seconds.

    #+begin_src emacs-lisp
      (defcustom wallpaper-cycle-interval 15
        "Interval in seconds for cycling in function `wallpaper-cycle-mode'."
        :tag "Wallpaper cycle interval"
        :group 'wallpaper
        :type 'integer)
    #+end_src

*** Setting multiple wallpapers

    If you are wanting to use the same wallpaper on each monitor when cycling
    wallpapers, set =wallpaper-single= to non-nil.

    #+begin_src emacs-lisp
      (defcustom wallpaper-single nil
        "Whether to use one wallpaper across all monitors.

      This setting is not respected when `wallpaper-static-wallpapers' is
      non-nil.  To have only one wallpaper for all monitors, ensure only
      one path is listed in `wallpaper-static-wallpapers'."
        :tag "Single wallpaper"
        :group 'wallpaper
        :type 'boolean)
    #+end_src

*** Setting the wallpaper directory

    By default, wallpapers are searched for in =~/.config/wallpapers= when
    cycling wallpapers, but of course not everyone may want to store their
    wallpapers there, in which case you'll have to set the variable
    =wallpaper-directory= to where your wallpapers are stored.

    #+begin_src emacs-lisp
      (defcustom wallpaper-directory (expand-file-name "~/.config/wallpapers")
        "The directory in which to look for wallpapers."
        :tag "Wallpaper directory"
        :group 'wallpaper
        :type 'string)
    #+end_src

** Wallpaper style

   #+begin_src emacs-lisp :exports none
     
   #+end_src

